InformationRegisters/БазыПоЗадачам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<InformationRegister>
		<Properties>
			<Name>БазыПоЗадачам</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Задача</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ITC_Задача</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>База</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ITC_База</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/БазыПоЗадачам/Ext/ManagerModule.bsl
// Получает массив баз, связанных с выбранной задачей
//
// Параметры:
//  Задача  - СправочникСсылка.ITC_Задача - Задача, по которой нужно получить базы
//
// Возвращаемое значение:
//   Массив   - Массив
//
Функция ПолучитьБазыПоЗадаче(Задача) Экспорт

	Результат = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	БазыПоЗадачам.База КАК База
		|ИЗ
		|	РегистрСведений.БазыПоЗадачам КАК БазыПоЗадачам
		|ГДЕ
		|	БазыПоЗадачам.Задача = &Задача";
	
	Запрос.УстановитьПараметр("Задача", Задача);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
	
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Результат.Добавить(ВыборкаДетальныеЗаписи.База);
		КонецЦикла;
	
	КонецЕсли;

    Возврат Результат;
КонецФункции // ПолучитьБазыПоЗадаче()
